ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32U5xx/stm32u599xx.h
/*******************  Bit definition for DSI_BCFGR register  ***************/
#define DSI_BCFGR_PWRUP_Pos           (6U)
#define DSI_BCFGR_PWRUP_Msk           (0x1UL << DSI_BCFGR_PWRUP_Pos)           /*!< 0x00000040 */
#define DSI_BCFGR_PWRUP               DSI_BCFGR_PWRUP_Msk                      /*!< Reference bias power up */

/*******************  Bit definition for DSI_D-PHY registers  ***************/
/*******************  Bit definition for DSI_DPCBCR register  ***************/
#define DSI_DPCBCR_Pos                (3U)
#define DSI_DPCBCR_Msk                (0x1FUL << DSI_DPCBCR_Pos)               /*!< 0x000000F8 */
#define DSI_DPCBCR                    DSI_DPCBCR_Msk                           /*!< clock band control register */
#define DSI_DPCBCR0_Pos               (3U)
#define DSI_DPCBCR0_Msk               (0x1UL << DSI_DPCBCR0_Pos)               /*!< 0x00000008 */
#define DSI_DPCBCR0                   DSI_DPCBCR0_Msk
#define DSI_DPCBCR1_Pos               (4U)
#define DSI_DPCBCR1_Msk               (0x1UL << DSI_DPCBCR1_Pos)               /*!< 0x00000010 */
#define DSI_DPCBCR1                   DSI_DPCBCR1_Msk
#define DSI_DPCBCR2_Pos               (5U)
#define DSI_DPCBCR2_Msk               (0x1UL << DSI_DPCBCR2_Pos)               /*!< 0x00000020 */
#define DSI_DPCBCR2                   DSI_DPCBCR2_Msk
#define DSI_DPCBCR3_Pos               (6U)
#define DSI_DPCBCR3_Msk               (0x1UL << DSI_DPCBCR3_Pos)               /*!< 0x00000040 */
#define DSI_DPCBCR3                   DSI_DPCBCR3_Msk
#define DSI_DPCBCR4_Pos               (7U)
#define DSI_DPCBCR4_Msk               (0x1UL << DSI_DPCBCR4_Pos)               /*!< 0x00000080 */
#define DSI_DPCBCR4                   DSI_DPCBCR4_Msk

/*******************  Bit definition for DSI_DPCSRCR register  ***************/
#define DSI_DPCSRCR_Pos                (0U)
#define DSI_DPCSRCR_Msk                (0xFFUL << DSI_DPCSRCR_Pos)          /*!< 0x000000FF */
#define DSI_DPCSRCR                    DSI_DPCSRCR_Msk                      /*!< clock slew rate control register*/
#define DSI_DPCSRCR0_Pos               (0U)
#define DSI_DPCSRCR0_Msk               (0x1UL << DSI_DPCSRCR0_Pos)         /*!< 0x00000001 */
#define DSI_DPCSRCR0                   DSI_DPCSRCR0_Msk
#define DSI_DPCSRCR1_Pos               (1U)
#define DSI_DPCSRCR1_Msk               (0x1UL << DSI_DPCSRCR1_Pos)         /*!< 0x00000002 */
#define DSI_DPCSRCR1                   DSI_DPCSRCR1_Msk
#define DSI_DPCSRCR2_Pos               (2U)
#define DSI_DPCSRCR2_Msk               (0x1UL << DSI_DPCSRCR2_Pos)         /*!< 0x00000004 */
#define DSI_DPCSRCR2                   DSI_DPCSRCR2_Msk
#define DSI_DPCSRCR3_Pos               (3U)
#define DSI_DPCSRCR3_Msk               (0x1UL << DSI_DPCSRCR3_Pos)         /*!< 0x00000008 */
#define DSI_DPCSRCR3                   DSI_DPCSRCR3_Msk
#define DSI_DPCSRCR4_Pos               (4U)
#define DSI_DPCSRCR4_Msk               (0x1UL << DSI_DPCSRCR4_Pos)         /*!< 0x00000010 */
#define DSI_DPCSRCR4                   DSI_DPCSRCR4_Msk
#define DSI_DPCSRCR5_Pos               (5U)
#define DSI_DPCSRCR5_Msk               (0x1UL << DSI_DPCSRCR5_Pos)         /*!< 0x00000020 */
#define DSI_DPCSRCR5                   DSI_DPCSRCR5_Msk
#define DSI_DPCSRCR6_Pos               (6U)
#define DSI_DPCSRCR6_Msk               (0x1UL << DSI_DPCSRCR6_Pos)         /*!< 0x00000040 */
#define DSI_DPCSRCR6                   DSI_DPCSRCR6_Msk
#define DSI_DPCSRCR7_Pos               (7U)
#define DSI_DPCSRCR7_Msk               (0x1UL << DSI_DPCSRCR7_Pos)         /*!< 0x00000080 */
#define DSI_DPCSRCR7                   DSI_DPCSRCR7_Msk

/*******************  Bit definition for DSI_DPDL0HSOCR register  ***************/
#define DSI_DPDL0HSOCR_Pos             (4U)
#define DSI_DPDL0HSOCR_Msk             (0xFUL << DSI_DPDL0HSOCR_Pos)         /*!< 0x000000F0 */
#define DSI_DPDL0HSOCR                 DSI_DPDL0HSOCR_Msk                    /*!< data lane0 HS Prepare offset */
#define DSI_DPDL0HSOCR_HSPRPO0_Pos     (4U)
#define DSI_DPDL0HSOCR_HSPRPO0_Msk     (0x1UL << DSI_DPDL0HSOCR_HSPRPO0_Pos) /*!< 0x00000010 */
#define DSI_DPDL0HSOCR_HSPRPO0         DSI_DPDL0HSOCR_HSPRPO0_Msk
#define DSI_DPDL0HSOCR_HSPRPO1_Pos     (5U)
#define DSI_DPDL0HSOCR_HSPRPO1_Msk     (0x1UL << DSI_DPDL0HSOCR_HSPRPO1_Pos) /*!< 0x00000020 */
#define DSI_DPDL0HSOCR_HSPRPO1         DSI_DPDL0HSOCR_HSPRPO1_Msk
#define DSI_DPDL0HSOCR_HSPRPO2_Pos     (6U)
#define DSI_DPDL0HSOCR_HSPRPO2_Msk     (0x1UL << DSI_DPDL0HSOCR_HSPRPO2_Pos) /*!< 0x00000040 */
#define DSI_DPDL0HSOCR_HSPRPO2         DSI_DPDL0HSOCR_HSPRPO2_Msk
#define DSI_DPDL0HSOCR_HSPRPO3_Pos     (7U)
#define DSI_DPDL0HSOCR_HSPRPO3_Msk     (0x1UL << DSI_DPDL0HSOCR_HSPRPO3_Pos) /*!< 0x00000080 */
#define DSI_DPDL0HSOCR_HSPRPO3         DSI_DPDL0HSOCR_HSPRPO3_Msk

/*******************  Bit definition for DSI_DPDL0LPXOCR register  ***************/
#define DSI_DPDL0LPXOCR_Pos            (0U)
#define DSI_DPDL0LPXOCR_Msk            (0xFUL << DSI_DPDL0LPXOCR_Pos)         /*!< 0x0000000F */
#define DSI_DPDL0LPXOCR                DSI_DPDL0LPXOCR_Msk                    /*!< data lane 0 LPX Offset */
#define DSI_DPDL0LPXOCR_LPXO0_Pos      (0U)
#define DSI_DPDL0LPXOCR_LPXO0_Msk      (0x1UL << DSI_DPDL0LPXOCR_LPXO0_Pos)   /*!< 0x00000001 */
#define DSI_DPDL0LPXOCR_LPXO0          DSI_DPDL0LPXOCR_LPXO0_Msk
#define DSI_DPDL0LPXOCR_LPXO1_Pos      (1U)
#define DSI_DPDL0LPXOCR_LPXO1_Msk      (0x1UL << DSI_DPDL0LPXOCR_LPXO1_Pos)   /*!< 0x00000002 */
#define DSI_DPDL0LPXOCR_LPXO1          DSI_DPDL0LPXOCR_LPXO1_Msk
#define DSI_DPDL0LPXOCR_LPXO2_Pos      (2U)
#define DSI_DPDL0LPXOCR_LPXO2_Msk      (0x1UL << DSI_DPDL0LPXOCR_LPXO2_Pos)   /*!< 0x00000004 */
#define DSI_DPDL0LPXOCR_LPXO2          DSI_DPDL0LPXOCR_LPXO2_Msk
#define DSI_DPDL0LPXOCR_LPXO3_Pos      (3U)
#define DSI_DPDL0LPXOCR_LPXO3_Msk      (0x1UL << DSI_DPDL0LPXOCR_LPXO3_Pos)   /*!< 0x00000008 */
#define DSI_DPDL0LPXOCR_LPXO3          DSI_DPDL0LPXOCR_LPXO3_Msk

/*******************  Bit definition for DSI_DPDL0BCR register  ***************/
#define DSI_DPDL0BCR_Pos                (0U)
#define DSI_DPDL0BCR_Msk                (0x1FUL << DSI_DPDL0BCR_Pos)         /*!< 0x0000001F */
#define DSI_DPDL0BCR                    DSI_DPDL0BCR_Msk                     /*!< data lane 0 band control register */
#define DSI_DPDL0BCR0_Pos               (0U)
#define DSI_DPDL0BCR0_Msk               (0x1UL << DSI_DPDL0BCR0_Pos)         /*!< 0x00000001 */
#define DSI_DPDL0BCR0                   DSI_DPDL0BCR0_Msk
#define DSI_DPDL0BCR1_Pos               (1U)
#define DSI_DPDL0BCR1_Msk               (0x1UL << DSI_DPDL0BCR1_Pos)         /*!< 0x00000002 */
#define DSI_DPDL0BCR1                   DSI_DPDL0BCR1_Msk
#define DSI_DPDL0BCR2_Pos               (2U)
#define DSI_DPDL0BCR2_Msk               (0x1UL << DSI_DPDL0BCR2_Pos)         /*!< 0x00000004 */
#define DSI_DPDL0BCR2                   DSI_DPDL0BCR2_Msk
#define DSI_DPDL0BCR3_Pos               (3U)
#define DSI_DPDL0BCR3_Msk               (0x1UL << DSI_DPDL0BCR3_Pos)         /*!< 0x00000008 */
#define DSI_DPDL0BCR3                   DSI_DPDL0BCR3_Msk
#define DSI_DPDL0BCR4_Pos               (4U)
#define DSI_DPDL0BCR4_Msk               (0x1UL << DSI_DPDL0BCR4_Pos)         /*!< 0x00000010 */
#define DSI_DPDL0BCR4                   DSI_DPDL0BCR4_Msk

/*******************  Bit definition for DSI_DPDL0SRCR register  ***************/
#define DSI_DPDL0SRCR_Pos                (0U)
#define DSI_DPDL0SRCR_Msk                (0xFFUL << DSI_DPDL0SRCR_Pos)         /*!< 0x000000FF */
#define DSI_DPDL0SRCR                    DSI_DPDL0SRCR_Msk                     /*!< data lane 0 slew rate control register */
#define DSI_DPDL0SRCR0_Pos               (0U)
#define DSI_DPDL0SRCR0_Msk               (0x1UL << DSI_DPDL0SRCR0_Pos)         /*!< 0x00000001 */
#define DSI_DPDL0SRCR0                   DSI_DPDL0SRCR0_Msk
#define DSI_DPDL0SRCR1_Pos               (1U)
#define DSI_DPDL0SRCR1_Msk               (0x1UL << DSI_DPDL0SRCR1_Pos)         /*!< 0x00000002 */
#define DSI_DPDL0SRCR1                   DSI_DPDL0SRCR1_Msk
#define DSI_DPDL0SRCR2_Pos               (2U)
#define DSI_DPDL0SRCR2_Msk               (0x1UL << DSI_DPDL0SRCR2_Pos)         /*!< 0x00000004 */
#define DSI_DPDL0SRCR2                   DSI_DPDL0SRCR2_Msk
#define DSI_DPDL0SRCR3_Pos               (3U)
#define DSI_DPDL0SRCR3_Msk               (0x1UL << DSI_DPDL0SRCR3_Pos)         /*!< 0x00000008 */
#define DSI_DPDL0SRCR3                   DSI_DPDL0SRCR3_Msk
#define DSI_DPDL0SRCR4_Pos               (4U)
#define DSI_DPDL0SRCR4_Msk               (0x1UL << DSI_DPDL0SRCR4_Pos)         /*!< 0x00000010 */
#define DSI_DPDL0SRCR4                   DSI_DPDL0SRCR4_Msk
#define DSI_DPDL0SRCR5_Pos               (5U)
#define DSI_DPDL0SRCR5_Msk               (0x1UL << DSI_DPDL0SRCR5_Pos)         /*!< 0x00000020 */
#define DSI_DPDL0SRCR5                   DSI_DPDL0SRCR5_Msk
#define DSI_DPDL0SRCR6_Pos               (6U)
#define DSI_DPDL0SRCR6_Msk               (0x1UL << DSI_DPDL0SRCR6_Pos)         /*!< 0x00000040 */
#define DSI_DPDL0SRCR6                   DSI_DPDL0SRCR6_Msk
#define DSI_DPDL0SRCR7_Pos               (7U)
#define DSI_DPDL0SRCR7_Msk               (0x1UL << DSI_DPDL0SRCR7_Pos)         /*!< 0x00000080 */
#define DSI_DPDL0SRCR7                   DSI_DPDL0SRCR7_Msk

/*******************  Bit definition for DSI_DPDL1HSOCR register  ***************/
#define DSI_DPDL1HSOCR_Pos             (4U)
#define DSI_DPDL1HSOCR_Msk             (0xFUL << DSI_DPDL1HSOCR_Pos)           /*!< 0x000000F0 */
#define DSI_DPDL1HSOCR                 DSI_DPDL1HSOCR_Msk                      /*!< data lane1 HS Prepare offset */
#define DSI_DPDL1HSOCR_HSPRPO00_Pos    (4U)
#define DSI_DPDL1HSOCR_HSPRPO00_Msk    (0x1UL << DSI_DPDL1HSOCR_HSPRPO00_Pos)  /*!< 0x00000010 */
#define DSI_DPDL1HSOCR_HSPRPO00        DSI_DPDL1HSOCR_HSPRPO00_Msk
#define DSI_DPDL1HSOCR_HSPRPO01_Pos    (5U)
#define DSI_DPDL1HSOCR_HSPRPO01_Msk    (0x1UL << DSI_DPDL1HSOCR_HSPRPO01_Pos)  /*!< 0x00000020 */
#define DSI_DPDL1HSOCR_HSPRPO01        DSI_DPDL1HSOCR_HSPRPO01_Msk
#define DSI_DPDL1HSOCR_HSPRPO02_Pos    (6U)
#define DSI_DPDL1HSOCR_HSPRPO02_Msk    (0x1UL << DSI_DPDL1HSOCR_HSPRPO02_Pos)  /*!< 0x00000040 */
#define DSI_DPDL1HSOCR_HSPRPO02        DSI_DPDL1HSOCR_HSPRPO02_Msk
#define DSI_DPDL1HSOCR_HSPRPO03_Pos    (7U)
#define DSI_DPDL1HSOCR_HSPRPO03_Msk    (0x1UL << DSI_DPDL1HSOCR_HSPRPO03_Pos)  /*!< 0x00000080 */
#define DSI_DPDL1HSOCR_HSPRPO03        DSI_DPDL1HSOCR_HSPRPO03_Msk

/*******************  Bit definition for DSI_DPDL1LPXOCR register  ***************/
#define DSI_DPDL1LPXOCR_Pos            (0U)
#define DSI_DPDL1LPXOCR_Msk            (0xFUL << DSI_DPDL1LPXOCR_Pos)          /*!< 0x0000000F */
#define DSI_DPDL1LPXOCR                DSI_DPDL1LPXOCR_Msk                     /*!< data lane1 LPX Offset*/
#define DSI_DPDL1LPXOCR_LPXO0_Pos      (0U)
#define DSI_DPDL1LPXOCR_LPXO0_Msk      (0x1UL << DSI_DPDL1LPXOCR_LPXO0_Pos)    /*!< 0x00000010 */
#define DSI_DPDL1LPXOCR_LPXO0          DSI_DPDL1LPXOCR_LPXO0_Msk
#define DSI_DPDL1LPXOCR_LPXO1_Pos      (1U)
#define DSI_DPDL1LPXOCR_LPXO1_Msk      (0x1UL << DSI_DPDL1LPXOCR_LPXO1_Pos)    /*!< 0x00000020 */
#define DSI_DPDL1LPXOCR_LPXO1          DSI_DPDL1LPXOCR_LPXO1_Msk
#define DSI_DPDL1LPXOCR_LPXO2_Pos      (2U)
#define DSI_DPDL1LPXOCR_LPXO2_Msk      (0x1UL << DSI_DPDL1LPXOCR_LPXO2_Pos)    /*!< 0x00000040 */
#define DSI_DPDL1LPXOCR_LPXO2          DSI_DPDL1LPXOCR_LPXO2_Msk
#define DSI_DPDL1LPXOCR_LPXO3_Pos      (3U)
#define DSI_DPDL1LPXOCR_LPXO3_Msk      (0x1UL << DSI_DPDL1LPXOCR_LPXO3_Pos)    /*!< 0x00000080 */
#define DSI_DPDL1LPXOCR_LPXO3          DSI_DPDL1LPXOCR_LPXO3_Msk

/*******************  Bit definition for DSI_DPDL1BCR register  ***************/
#define DSI_DPDL1BCR_Pos                (0U)
#define DSI_DPDL1BCR_Msk                (0x1FUL << DSI_DPDL1BCR_Pos)         /*!< 0x0000001F */
#define DSI_DPDL1BCR                    DSI_DPDL1BCR_Msk                     /*!< data lane 1 band control register */
#define DSI_DPDL1BCR0_Pos               (0U)
#define DSI_DPDL1BCR0_Msk               (0x1UL << DSI_DPDL1BCR0_Pos)         /*!< 0x00000001 */
#define DSI_DPDL1BCR0                   DSI_DPDL1BCR0_Msk
#define DSI_DPDL1BCR1_Pos               (1U)
#define DSI_DPDL1BCR1_Msk               (0x1UL << DSI_DPDL1BCR1_Pos)         /*!< 0x00000002 */
#define DSI_DPDL1BCR1                   DSI_DPDL1BCR1_Msk
#define DSI_DPDL1BCR2_Pos               (2U)
#define DSI_DPDL1BCR2_Msk               (0x1UL << DSI_DPDL1BCR2_Pos)         /*!< 0x00000004 */
#define DSI_DPDL1BCR2                   DSI_DPDL1BCR2_Msk
#define DSI_DPDL1BCR3_Pos               (3U)
#define DSI_DPDL1BCR3_Msk               (0x1UL << DSI_DPDL1BCR3_Pos)         /*!< 0x00000008 */
#define DSI_DPDL1BCR3                   DSI_DPDL1BCR3_Msk
#define DSI_DPDL1BCR4_Pos               (4U)
#define DSI_DPDL1BCR4_Msk               (0x1UL << DSI_DPDL1BCR4_Pos)         /*!< 0x00000010 */
#define DSI_DPDL1BCR4                   DSI_DPDL1BCR4_Msk

